//#include <iostream>
//using namespace std;
//
//int main()
//{
//	int a[5] = { 3, 2, 5, 4, 1 };
//	int temp;
//	//cout << size(a) << endl;
//
//	//버블정렬 - 두 수를 비교해서 더 작은 숫자가 왼쪽에 위치함(오름차순)
//	for (int i = 0; i < size(a) - 1; i++) { //4
//		for (int j = i + 1; j < size(a); j++) { //5
//			if (a[i] > a[j]) { //앞수가 뒷수보다 크면 교환 처리
//				temp = a[i];
//				a[i] = a[j];
//				a[j] = temp;
//			}
//		}
//	}
//	/*
//	   { 3, 2, 5, 4, 1 }
//	   i=0, j=1, 3>2, 2,3,5,4,1
//	        j=2, 2>5, 교환없음
//			j=3, 2>4, 교환없음
//			j=4, 2>1, 1,3,5,4,2
//	   i=1, j=2, 3>5, 교환없음
//	        j=3, 3>4, 교환없음
//			j=4, 3>2, 1,2,5,4,3
//	   i=2, j=3, 5>4, 1,2,4,5,3
//	        j=4, 4>3, 1,2,3,5,4
//	   i=3, j=4, 5>4, 1,2,3,4,5 정렬 완료!
//	*/
//
//	for (int i = 0; i < 5; i++) {
//		cout << a[i] << " ";
//	}
//
//	return 0;
//}
