//#include <stdio.h>
//
//int main()
//{
//	int a[5] = { 3, 2, 5, 1, 4 };
//	int i, j, temp;
//
//	//현 위치의 요소와 다음 요소 교환
//	/*for (i = 0; i < 4; i++)
//	{
//		temp = a[i];
//		a[i] = a[i + 1];
//		a[i + 1] = temp;
//	}
//
//	for (i = 0; i < 5; i++)
//	{
//		printf("%d ", a[i]);
//	}*/
//
//	/*
//	  i=0, 2 3 5 1 4
//	  i=1, 2 5 3 1 4
//	  i=2, 2 5 1 3 4
//	  i=3, 2 5 1 4 3
//	*/
//
//	//오름차순 정렬 - 버블정렬
//	/*for (i = 0; i < 5; i++)
//	{
//		for (j = 0; j < 4; j++)
//		{
//			if (a[j] > a[j + 1])
//			{
//				temp = a[j];
//				a[j] = a[j + 1];
//				a[j + 1] = temp;
//			}
//		}
//	}*/
//
//	/*
//	   a[] = { 3, 2, 5, 1, 4 }
//	   i=0, j=0, 2 3 5 1 4  //교환
//			j=1, 2 3 5 1 4  //유지
//			j=2, 2 3 1 5 4  //교환
//			j=3, 2 3 1 4 5  //변경 저장
//	   i=1, j=0, 2 3 1 4 5
//			j=1, 2 1 3 4 5  //변경 저장
//	   i=2, j=0, 1 2 3 4 5  //최종 저장
//	   i=3, 교환없음
//	   i=4, 교환없음
//	*/
//
//	//교환이 없으면 종료하기
//	int sw;  //상태 변수
//	for (i = 0; i < 5; i++)
//	{
//		sw = 0; //교환 없음
//		for (j = 0; j < 4; j++)
//		{
//			if (a[j] > a[j + 1])
//			{
//				temp = a[j];
//				a[j] = a[j + 1];
//				a[j + 1] = temp;
//				sw = 1;  //교환 발생
//			}
//		}
//		if (!sw) break; //교환 없으면 종료
//	}
//
//	for (i = 0; i < 5; i++)
//	{
//		printf("%d ", a[i]);
//	}
//
//	
//
//	return 0;
//}