//#include <stdio.h>
///*
//	버블 정렬 - 서로 이웃하는 요소를 비교함
//	왼쪽보다 오른쪽이 작으면 두 요소를 바꾸며
//	오름차순 정렬
//*/
//
//int main()
//{
//	//버블 정렬 - 오름차순
//	int arr[5] = {41, 8, 36, 77, 15};
//	int i, j, temp;
//
//	//비교와 교환 반복
//	for (i = 0; i < 5; i++) {
//		for (j = 0; j < 4; j++) {
//			if (arr[j] > arr[j+1]) { 
//				temp = arr[j];
//				arr[j] = arr[j+1];
//				arr[j+1] = temp;
//			}
//		}
//	}
//
//	/*
//	  i=0, j=0, 41>8,  8,41,36,77,15
//		   j=1, 41>36, 8,36,41,77,15
//		   j=2, 41>77, 교환없음
//		   j=3, 77>15, 8,36,41,15,77
//	  i=1, j=0, 8>36,  교환없음
//		   j=1, 36>41, 교환없음
//		   j=2, 41>15, 8,36,15,41,77
//		   j=3, 41>77, 교환없음
//	  i=2, j=0, 8>36,  교환없음
//		   j=1, 36>15, 8,15,36,41,77
//	  i=3, 교환없음
//	  i=4, 교환없음
//	*/
//
//	//출력
//	for (i = 0; i < 5; i++) {
//		printf("%d ", arr[i]);
//	}
//
//	
//
//	printf("\n");
//
//	/*int a[5] = {41, 8, 36, 77, 15};
//	int i, j, temp;
//	int sw = 0; //상태 변수 
//
//	for (i = 0; i < 5; i++) {
//		for (j = 0; j < 4; j++) {
//			if (a[j] > a[j + 1]) { //'<'면 내림차순
//				temp = a[j];
//				a[j] = a[j + 1];
//				a[j + 1] = temp;
//			}
//			sw = 1; //교환 있음
//		}
//		if (!sw) { //sw == 0
//			break; //교환 없으면 종료
//		}
//	}
//
//	for (i = 0; i < 5; i++) {
//		printf("%d ", a[i]);
//	}*/
//
//	return 0;
//}
