#include <stdio.h>
/*
	버블 정렬 - 서로 이웃하는 요소를 비교함
	왼쪽보다 오른쪽이 작으면 두 요소를 바꾸며
	오름차순 정렬
*/

int main()
{
	//버블 정렬 - 오름차순
	/*int a[5] = {3, 2, 5, 1, 4};
	int i, j, temp;

	for (i = 0; i < 5; i++) {
		for (j = 0; j < 4; j++) {
			if (a[j] > a[j+1]) { //'<'면 내림차순
				temp = a[j];
				a[j] = a[j+1];
				a[j+1] = temp;
			}
		}
	}

	for (i = 0; i < 5; i++) {
		printf("%-2d", a[i]);
	}*/

	/*
	  i=0, j=0, 3>2, 2,3,5,1,4
		   j=1, 3>5, 교환없음
		   j=2, 5>1, 2,3,1,5,4
		   j=3, 5>4, 2,3,1,4,5
	  i=1, j=0, 2>3, 교환없음
		   j=1, 3>1, 2,1,3,4,5
		   j=2, 1>4, 교환없음
		   j=3, 4>5, 교환없음
	  i=2, j=0, 2>1, 1,2,3,4,5 //최종 저장
	  i=3, 교환없음
	  i=4, 교환없음
	  i=5, 반복종료
	*/

	printf("\n");

	int a[5] = { 3, 2, 5, 1, 4 };
	int i, j, temp;
	int sw = 0; //상태 변수 

	for (i = 0; i < 5; i++) {
		for (j = 0; j < 4; j++) {
			if (a[j] > a[j + 1]) { //'<'면 내림차순
				temp = a[j];
				a[j] = a[j + 1];
				a[j + 1] = temp;
			}
			sw = 1; //교환 있음
		}
		if (!sw) { //sw == 0
			break; //교환 없으면 종료
		}
	}

	for (i = 0; i < 5; i++) {
		printf("%-2d", a[i]);
	}

	return 0;
}
