//#include <stdio.h>
///*
//  - 역순으로 읽기
//    배열의 첨자 주의
//*/
//int main()
//{
//	char a1[] = "DOG";
//	char a2[10];  //충분한 크기 확보
//	int i;
//
//	//a1을 a2에 거꾸로 복사
//	for (i = 0; i < 4; i++) {
//		a2[i] = a1[2 - i];
//	}
//	a2[3] = '\0'; //문자열 끝에 널문자 추가
//
//	printf("%s를 거꾸로 읽으면 %s\n", a1, a2);
//
//	printf("-----------------------------\n");
//
//	int n;
//	char a[] = "DOG";
//	char b[10];
//
//	n = strlen(a); //3 - a의 개수
//
//	for (i = n-1; i >= 0; i--) {
//		b[n-1-i] = a[i];
//	}
//	b[n] = '\0';
//
//	printf("%s를 거꾸로 읽으면 %s\n", a, b);
//
//	return 0;
//}