//#include <stdio.h>
//
//int main()
//{
//	int arr[5];
//
//	//요소 추가
//	arr[0] = 1;
//	arr[1] = 2;
//	arr[2] = 3;
//	arr[3] = 4;
//	arr[4] = 5;
//
//	//출력
//	for (int i = 0; i < 5; i++)
//	{
//		printf("%3d", arr[i]);
//	}
//
//	printf("\n======================\n");
//
//	//2번 인덱스 삭제
//	//2번 인덱스 0으로 초기화
//	arr[2] = 0;
//
//	//배열의 인덱스 왼쪽으로 이동
//	for (int i = 2; i < 4; i++)
//	{
//		arr[i] = arr[i + 1];
//	}
//
//	//출력
//	for (int i = 0; i < 4; i++)
//	{
//		printf("%3d", arr[i]);
//	}
//
//	return 0;
//}
